maku2903/ultimate-nag52-fw-rs/SAME54P20A_patched.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>DMAC</name>
         <version>U25031.0.1</version>
         <description>Direct Memory Access Controller</description>
         <baseAddress>0x4100A000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x240</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>DMAC_0</name>
            <description>DMA Channel 0</description>
            <value>31</value>
         </interrupt>
         <interrupt>
            <name>DMAC_1</name>
            <description>DMA Channel 1</description>
            <value>32</value>
         </interrupt>
         <interrupt>
            <name>DMAC_2</name>
            <description>DMA Channel 2</description>
            <value>33</value>
         </interrupt>
         <interrupt>
            <name>DMAC_3</name>
            <description>DMA Channel 3</description>
            <value>34</value>
         </interrupt>
         <interrupt>
            <name>DMAC_OTHER</name>
            <description>DMA Channel 4..X</description>
            <value>35</value>
         </interrupt>
         <registers>
            <register>
               <name>CTRL</name>
               <description>Control</description>
               <addressOffset>0x0</addressOffset>
               <size>16</size>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>SWRST</name>
                     <description>Software Reset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMAENABLE</name>
                     <description>DMA Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LVLEN0</name>
                     <description>Priority Level 0 Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LVLEN1</name>
                     <description>Priority Level 1 Enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LVLEN2</name>
                     <description>Priority Level 2 Enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LVLEN3</name>
                     <description>Priority Level 3 Enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CRCCTRL</name>
               <description>CRC Control</description>
               <addressOffset>0x2</addressOffset>
               <size>16</size>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>CRCBEATSIZE</name>
                     <description>CRC Beat Size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>CRCBEATSIZESelect</name>
                        <enumeratedValue>
                           <name>BYTE</name>
                           <description>8-bit bus transfer</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HWORD</name>
                           <description>16-bit bus transfer</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WORD</name>
                           <description>32-bit bus transfer</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CRCPOLY</name>
                     <description>CRC Polynomial Type</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>CRCPOLYSelect</name>
                        <enumeratedValue>
                           <name>CRC16</name>
                           <description>CRC-16 (CRC-CCITT)</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CRC32</name>
                           <description>CRC32 (IEEE 802.3)</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CRCSRC</name>
                     <description>CRC Input Source</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                     <enumeratedValues>
                        <name>CRCSRCSelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>CRC Disabled</description>
                           <value>0x00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IO</name>
                           <description>I/O interface</description>
                           <value>0x01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CHN0</name>
                           <description>DMA Channel 0</description>
                           <value>0x20</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CHN1</name>
                           <description>DMA Channel 1</description>
                           <value>0x21</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CHN2</name>
                           <description>DMA Channel 2</description>
                           <value>0x22</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CHN3</name>
                           <description>DMA Channel 3</description>
                           <value>0x23</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CHN4</name>
                           <description>DMA Channel 4</description>
                           <value>0x24</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CHN5</name>
                           <description>DMA Channel 5</description>
                           <value>0x25</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CHN6</name>
                           <description>DMA Channel 6</description>
                           <value>0x26</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CHN7</name>
                           <description>DMA Channel 7</description>
                           <value>0x27</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CHN8</name>
                           <description>DMA Channel 8</description>
                           <value>0x28</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CHN9</name>
                           <description>DMA Channel 9</description>
                           <value>0x29</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CHN10</name>
                           <description>DMA Channel 10</description>
                           <value>0x2A</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CHN11</name>
                           <description>DMA Channel 11</description>
                           <value>0x2B</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CHN12</name>
                           <description>DMA Channel 12</description>
                           <value>0x2C</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CHN13</name>
                           <description>DMA Channel 13</description>
                           <value>0x2D</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CHN14</name>
                           <description>DMA Channel 14</description>
                           <value>0x2E</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CHN15</name>
                           <description>DMA Channel 15</description>
                           <value>0x2F</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CHN16</name>
                           <description>DMA Channel 16</description>
                           <value>0x30</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CHN17</name>
                           <description>DMA Channel 17</description>
                           <value>0x31</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CHN18</name>
                           <description>DMA Channel 18</description>
                           <value>0x32</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CHN19</name>
                           <description>DMA Channel 19</description>
                           <value>0x33</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CHN20</name>
                           <description>DMA Channel 20</description>
                           <value>0x34</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CHN21</name>
                           <description>DMA Channel 21</description>
                           <value>0x35</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CHN22</name>
                           <description>DMA Channel 22</description>
                           <value>0x36</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CHN23</name>
                           <description>DMA Channel 23</description>
                           <value>0x37</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CHN24</name>
                           <description>DMA Channel 24</description>
                           <value>0x38</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CHN25</name>
                           <description>DMA Channel 25</description>
                           <value>0x39</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CHN26</name>
                           <description>DMA Channel 26</description>
                           <value>0x3A</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CHN27</name>
                           <description>DMA Channel 27</description>
                           <value>0x3B</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CHN28</name>
                           <description>DMA Channel 28</description>
                           <value>0x3C</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CHN29</name>
                           <description>DMA Channel 29</description>
                           <value>0x3D</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CHN30</name>
                           <description>DMA Channel 30</description>
                           <value>0x3E</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CHN31</name>
                           <description>DMA Channel 31</description>
                           <value>0x3F</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CRCMODE</name>
                     <description>CRC Operating Mode</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>CRCMODESelect</name>
                        <enumeratedValue>
                           <name>DEFAULT</name>
                           <description>Default operating mode</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CRCMON</name>
                           <description>Memory CRC monitor operating mode</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CRCGEN</name>
                           <description>Memory CRC generation operating mode</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CRCDATAIN</name>
               <description>CRC Data Input</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CRCDATAIN</name>
                     <description>CRC Data Input</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CRCCHKSUM</name>
               <description>CRC Checksum</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CRCCHKSUM</name>
                     <description>CRC Checksum</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CRCSTATUS</name>
               <description>CRC Status</description>
               <addressOffset>0xC</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>CRCBUSY</name>
                     <description>CRC Module Busy</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CRCZERO</name>
                     <description>CRC Zero</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CRCERR</name>
                     <description>CRC Error</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DBGCTRL</name>
               <description>Debug Control</description>
               <addressOffset>0xD</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>DBGRUN</name>
                     <description>Debug Run</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
