maku2903/ultimate-nag52-fw-rs/SAME54P20A_patched.svd
            <cluster>
               <dim>32</dim>
               <dimIncrement>0x10</dimIncrement>
               <name>CHANNEL[%s]</name>
               <description/>
               <addressOffset>0x40</addressOffset>
               <register>
                  <name>CHCTRLA</name>
                  <description>Channel n Control A</description>
                  <addressOffset>0x0</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>SWRST</name>
                        <description>Channel Software Reset</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ENABLE</name>
                        <description>Channel Enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RUNSTDBY</name>
                        <description>Channel Run in Standby</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TRIGSRC</name>
                        <description>Trigger Source</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>7</bitWidth>
                        <enumeratedValues><name>TRIGSRCSelect</name><enumeratedValue>
                              <name>DISABLE</name>
                              <description>Only software/event triggers</description>
                              <value>0</value>
                           </enumeratedValue><enumeratedValue><name>RTC_TIMESTAMP</name><description>DMA RTC timestamp trigger</description><value>0x01</value></enumeratedValue><enumeratedValue><name>DSU_DCC0</name><description>DMAC ID for DCC0 register</description><value>0x02</value></enumeratedValue><enumeratedValue><name>DSU_DCC1</name><description>DMAC ID for DCC1 register</description><value>0x03</value></enumeratedValue><enumeratedValue><name>SERCOM0_RX</name><description>Index of DMA RX trigger</description><value>0x04</value></enumeratedValue><enumeratedValue><name>SERCOM0_TX</name><description>Index of DMA TX trigger</description><value>0x05</value></enumeratedValue><enumeratedValue><name>SERCOM1_RX</name><description>Index of DMA RX trigger</description><value>0x06</value></enumeratedValue><enumeratedValue><name>SERCOM1_TX</name><description>Index of DMA TX trigger</description><value>0x07</value></enumeratedValue><enumeratedValue><name>SERCOM2_RX</name><description>Index of DMA RX trigger</description><value>0x08</value></enumeratedValue><enumeratedValue><name>SERCOM2_TX</name><description>Index of DMA TX trigger</description><value>0x09</value></enumeratedValue><enumeratedValue><name>SERCOM3_RX</name><description>Index of DMA RX trigger</description><value>0x0A</value></enumeratedValue><enumeratedValue><name>SERCOM3_TX</name><description>Index of DMA TX trigger</description><value>0x0B</value></enumeratedValue><enumeratedValue><name>SERCOM4_RX</name><description>Index of DMA RX trigger</description><value>0x0C</value></enumeratedValue><enumeratedValue><name>SERCOM4_TX</name><description>Index of DMA TX trigger</description><value>0x0D</value></enumeratedValue><enumeratedValue><name>SERCOM5_RX</name><description>Index of DMA RX trigger</description><value>0x0E</value></enumeratedValue><enumeratedValue><name>SERCOM5_TX</name><description>Index of DMA TX trigger</description><value>0x0F</value></enumeratedValue><enumeratedValue><name>SERCOM6_RX</name><description>Index of DMA RX trigger</description><value>0x10</value></enumeratedValue><enumeratedValue><name>SERCOM6_TX</name><description>Index of DMA TX trigger</description><value>0x11</value></enumeratedValue><enumeratedValue><name>SERCOM7_RX</name><description>Index of DMA RX trigger</description><value>0x12</value></enumeratedValue><enumeratedValue><name>SERCOM7_TX</name><description>Index of DMA TX trigger</description><value>0x13</value></enumeratedValue><enumeratedValue><name>CAN0_DEBUG</name><description>DMA CAN Debug Req</description><value>0x14</value></enumeratedValue><enumeratedValue><name>CAN1_DEBUG</name><description>DMA CAN Debug Req</description><value>0x15</value></enumeratedValue><enumeratedValue><name>TCC0_OVF</name><description>DMA overflow/underflow/retrigger trigger</description><value>0x16</value></enumeratedValue><enumeratedValue><name>TCC0_MC_0</name><description>Indexes of DMA Match/Compare triggers</description><value>0x17</value></enumeratedValue><enumeratedValue><name>TCC0_MC_1</name><description>Indexes of DMA Match/Compare triggers</description><value>0x18</value></enumeratedValue><enumeratedValue><name>TCC0_MC_2</name><description>Indexes of DMA Match/Compare triggers</description><value>0x19</value></enumeratedValue><enumeratedValue><name>TCC0_MC_3</name><description>Indexes of DMA Match/Compare triggers</description><value>0x1A</value></enumeratedValue><enumeratedValue><name>TCC0_MC_4</name><description>Indexes of DMA Match/Compare triggers</description><value>0x1B</value></enumeratedValue><enumeratedValue><name>TCC0_MC_5</name><description>Indexes of DMA Match/Compare triggers</description><value>0x1C</value></enumeratedValue><enumeratedValue><name>TCC1_OVF</name><description>DMA overflow/underflow/retrigger trigger</description><value>0x1D</value></enumeratedValue><enumeratedValue><name>TCC1_MC_0</name><description>Indexes of DMA Match/Compare triggers</description><value>0x1E</value></enumeratedValue><enumeratedValue><name>TCC1_MC_1</name><description>Indexes of DMA Match/Compare triggers</description><value>0x1F</value></enumeratedValue><enumeratedValue><name>TCC1_MC_2</name><description>Indexes of DMA Match/Compare triggers</description><value>0x20</value></enumeratedValue><enumeratedValue><name>TCC1_MC_3</name><description>Indexes of DMA Match/Compare triggers</description><value>0x21</value></enumeratedValue><enumeratedValue><name>TCC2_OVF</name><description>DMA overflow/underflow/retrigger trigger</description><value>0x22</value></enumeratedValue><enumeratedValue><name>TCC2_MC_0</name><description>Indexes of DMA Match/Compare triggers</description><value>0x23</value></enumeratedValue><enumeratedValue><name>TCC2_MC_1</name><description>Indexes of DMA Match/Compare triggers</description><value>0x24</value></enumeratedValue><enumeratedValue><name>TCC2_MC_2</name><description>Indexes of DMA Match/Compare triggers</description><value>0x25</value></enumeratedValue><enumeratedValue><name>TCC3_OVF</name><description>DMA overflow/underflow/retrigger trigger</description><value>0x26</value></enumeratedValue><enumeratedValue><name>TCC3_MC_0</name><description>Indexes of DMA Match/Compare triggers</description><value>0x27</value></enumeratedValue><enumeratedValue><name>TCC3_MC_1</name><description>Indexes of DMA Match/Compare triggers</description><value>0x28</value></enumeratedValue><enumeratedValue><name>TCC4_OVF</name><description>DMA overflow/underflow/retrigger trigger</description><value>0x29</value></enumeratedValue><enumeratedValue><name>TCC4_MC_0</name><description>Indexes of DMA Match/Compare triggers</description><value>0x2A</value></enumeratedValue><enumeratedValue><name>TCC4_MC_1</name><description>Indexes of DMA Match/Compare triggers</description><value>0x2B</value></enumeratedValue><enumeratedValue><name>TC0_OVF</name><description>Indexes of DMA Overflow trigger</description><value>0x2C</value></enumeratedValue><enumeratedValue><name>TC0_MC_0</name><description>Indexes of DMA Match/Compare triggers</description><value>0x2D</value></enumeratedValue><enumeratedValue><name>TC0_MC_1</name><description>Indexes of DMA Match/Compare triggers</description><value>0x2E</value></enumeratedValue><enumeratedValue><name>TC1_OVF</name><description>Indexes of DMA Overflow trigger</description><value>0x2F</value></enumeratedValue><enumeratedValue><name>TC1_MC_0</name><description>Indexes of DMA Match/Compare triggers</description><value>0x30</value></enumeratedValue><enumeratedValue><name>TC1_MC_1</name><description>Indexes of DMA Match/Compare triggers</description><value>0x31</value></enumeratedValue><enumeratedValue><name>TC2_OVF</name><description>Indexes of DMA Overflow trigger</description><value>0x32</value></enumeratedValue><enumeratedValue><name>TC2_MC_0</name><description>Indexes of DMA Match/Compare triggers</description><value>0x33</value></enumeratedValue><enumeratedValue><name>TC2_MC_1</name><description>Indexes of DMA Match/Compare triggers</description><value>0x34</value></enumeratedValue><enumeratedValue><name>TC3_OVF</name><description>Indexes of DMA Overflow trigger</description><value>0x35</value></enumeratedValue><enumeratedValue><name>TC3_MC_0</name><description>Indexes of DMA Match/Compare triggers</description><value>0x36</value></enumeratedValue><enumeratedValue><name>TC3_MC_1</name><description>Indexes of DMA Match/Compare triggers</description><value>0x37</value></enumeratedValue><enumeratedValue><name>TC4_OVF</name><description>Indexes of DMA Overflow trigger</description><value>0x38</value></enumeratedValue><enumeratedValue><name>TC4_MC_0</name><description>Indexes of DMA Match/Compare triggers</description><value>0x39</value></enumeratedValue><enumeratedValue><name>TC4_MC_1</name><description>Indexes of DMA Match/Compare triggers</description><value>0x3A</value></enumeratedValue><enumeratedValue><name>TC5_OVF</name><description>Indexes of DMA Overflow trigger</description><value>0x3B</value></enumeratedValue><enumeratedValue><name>TC5_MC_0</name><description>Indexes of DMA Match/Compare triggers</description><value>0x3C</value></enumeratedValue><enumeratedValue><name>TC5_MC_1</name><description>Indexes of DMA Match/Compare triggers</description><value>0x3D</value></enumeratedValue><enumeratedValue><name>TC6_OVF</name><description>Indexes of DMA Overflow trigger</description><value>0x3E</value></enumeratedValue><enumeratedValue><name>TC6_MC_0</name><description>Indexes of DMA Match/Compare triggers</description><value>0x3F</value></enumeratedValue><enumeratedValue><name>TC6_MC_1</name><description>Indexes of DMA Match/Compare triggers</description><value>0x40</value></enumeratedValue><enumeratedValue><name>TC7_OVF</name><description>Indexes of DMA Overflow trigger</description><value>0x41</value></enumeratedValue><enumeratedValue><name>TC7_MC_0</name><description>Indexes of DMA Match/Compare triggers</description><value>0x42</value></enumeratedValue><enumeratedValue><name>TC7_MC_1</name><description>Indexes of DMA Match/Compare triggers</description><value>0x43</value></enumeratedValue><enumeratedValue><name>ADC0_RESRDY</name><description>index of DMA RESRDY trigger</description><value>0x44</value></enumeratedValue><enumeratedValue><name>ADC0_SEQ</name><description>Index of DMA SEQ trigger</description><value>0x45</value></enumeratedValue><enumeratedValue><name>ADC1_RESRDY</name><description>Index of DMA RESRDY trigger</description><value>0x46</value></enumeratedValue><enumeratedValue><name>ADC1_SEQ</name><description>Index of DMA SEQ trigger</description><value>0x47</value></enumeratedValue><enumeratedValue><name>DAC_EMPTY_0</name><description>DMA DAC Empty Req</description><value>0x48</value></enumeratedValue><enumeratedValue><name>DAC_EMPTY_1</name><description>DMA DAC Empty Req</description><value>0x49</value></enumeratedValue><enumeratedValue><name>DAC_RESRDY_0</name><description>DMA DAC Result Ready Req</description><value>0x4A</value></enumeratedValue><enumeratedValue><name>DAC_RESRDY_1</name><description>DMA DAC Result Ready Req</description><value>0x4B</value></enumeratedValue><enumeratedValue><name>I2S_RX_0</name><description>Indexes of DMA RX triggers</description><value>0x4C</value></enumeratedValue><enumeratedValue><name>I2S_RX_1</name><description>Indexes of DMA RX triggers</description><value>0x4D</value></enumeratedValue><enumeratedValue><name>I2S_TX_0</name><description>Indexes of DMA TX triggers</description><value>0x4E</value></enumeratedValue><enumeratedValue><name>I2S_TX_1</name><description>Indexes of DMA TX triggers</description><value>0x4F</value></enumeratedValue><enumeratedValue><name>PCC_RX</name><description>Indexes of PCC RX trigger</description><value>0x50</value></enumeratedValue><enumeratedValue><name>AES_WR</name><description>DMA DATA Write trigger</description><value>0x51</value></enumeratedValue><enumeratedValue><name>AES_RD</name><description>DMA DATA Read trigger</description><value>0x52</value></enumeratedValue><enumeratedValue><name>QSPI_RX</name><description>Indexes of QSPI RX trigger</description><value>0x53</value></enumeratedValue><enumeratedValue><name>QSPI_TX</name><description>Indexes of QSPI TX trigger</description><value>0x54</value></enumeratedValue></enumeratedValues>
                     </field>
                     <field>
                        <name>TRIGACT</name>
                        <description>Trigger Action</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>TRIGACTSelect</name>
                           <enumeratedValue>
                              <name>BLOCK</name>
                              <description>One trigger required for each block transfer</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>BURST</name>
                              <description>One trigger required for each burst transfer</description>
                              <value>2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TRANSACTION</name>
                              <description>One trigger required for each transaction</description>
                              <value>3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>BURSTLEN</name>
                        <description>Burst Length</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>4</bitWidth>
                        <enumeratedValues>
                           <name>BURSTLENSelect</name>
                           <enumeratedValue>
                              <name>SINGLE</name>
                              <description>Single-beat burst length</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>2BEAT</name>
                              <description>2-beats burst length</description>
                              <value>1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>3BEAT</name>
                              <description>3-beats burst length</description>
                              <value>2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>4BEAT</name>
                              <description>4-beats burst length</description>
                              <value>3</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>5BEAT</name>
                              <description>5-beats burst length</description>
                              <value>4</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>6BEAT</name>
                              <description>6-beats burst length</description>
                              <value>5</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>7BEAT</name>
                              <description>7-beats burst length</description>
                              <value>6</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>8BEAT</name>
                              <description>8-beats burst length</description>
                              <value>7</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>9BEAT</name>
                              <description>9-beats burst length</description>
                              <value>8</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>10BEAT</name>
                              <description>10-beats burst length</description>
                              <value>9</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>11BEAT</name>
                              <description>11-beats burst length</description>
                              <value>10</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>12BEAT</name>
                              <description>12-beats burst length</description>
                              <value>11</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>13BEAT</name>
                              <description>13-beats burst length</description>
                              <value>12</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>14BEAT</name>
                              <description>14-beats burst length</description>
                              <value>13</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>15BEAT</name>
                              <description>15-beats burst length</description>
                              <value>14</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>16BEAT</name>
                              <description>16-beats burst length</description>
                              <value>15</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>THRESHOLD</name>
                        <description>FIFO Threshold</description>
                        <bitOffset>28</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>THRESHOLDSelect</name>
                           <enumeratedValue>
                              <name>1BEAT</name>
                              <description>Destination write starts after each beat source address read</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>2BEATS</name>
                              <description>Destination write starts after 2-beats source address read</description>
                              <value>1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>4BEATS</name>
                              <description>Destination write starts after 4-beats source address read</description>
                              <value>2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>8BEATS</name>
                              <description>Destination write starts after 8-beats source address read</description>
                              <value>3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CHCTRLB</name>
                  <description>Channel n Control B</description>
                  <addressOffset>0x4</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>CMD</name>
                        <description>Software Command</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>CMDSelect</name>
                           <enumeratedValue>
                              <name>NOACT</name>
                              <description>No action</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SUSPEND</name>
                              <description>Channel suspend operation</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>RESUME</name>
                              <description>Channel resume operation</description>
                              <value>0x2</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
